{
    "version": "https://jsonfeed.org/version/1",
    "title": "Labhoen",
    "description": "",
    "home_page_url": "https://www.labhoen.nl",
    "feed_url": "https://www.labhoen.nl/feed.json",
    "user_comment": "",
    "author": {
        "name": "mrhoen"
    },
    "items": [
        {
            "id": "https://www.labhoen.nl/itunes-in-combinatie-met-een-steamer-en-nas.html",
            "url": "https://www.labhoen.nl/itunes-in-combinatie-met-een-steamer-en-nas.html",
            "title": "iTunes in combinatie met een steamer en NAS",
            "summary": "iTunes is voor Mac gebruikers het ultieme programma voor het beheren van je digitale muziek collectie. Er is geen beter alternatief als je kijkt naar mogelijkheden en gebruiksgemak. Bovenal kun je het als één oplossing voor het beheer en distributie van al je digitale muziek&hellip;",
            "content_html": "<p class=\"p1\"><a href=\"https://www.apple.com/nl/itunes/\">iTunes</a> is voor Mac gebruikers het ultieme programma voor het beheren van je digitale muziek collectie. Er is geen beter alternatief als je kijkt naar mogelijkheden en gebruiksgemak. Bovenal kun je het als één oplossing voor het beheer en distributie van al je digitale muziek gebruiken. Direct afspelen vanaf de Mac, via een Apple TV of synchroniseren met iPad of iPhone, het is allemaal mogelijk. Maar … wat nu als je ook muziek wilt luisteren buiten het Apple universum? DLNA/UPnP zijn voor Apple niet bestaande technologieën. Met een beetje hulp kan iTunes toch van pas komen.</p>\n<p class=\"p1\">Het voordeel van een streamer is dat het een echt hifi-apparaat is. Dus geen computergedoe bij het luisteren van muziek, veelal te bedienen met een app. Voorbeelden hiervan zijn onder andere de <a href=\"https://www.cambridgeaudio.com/gbr/en/products/cx/cxn-v2\" target=\"_blank\" rel=\"noopener noreferrer\">Cambridge Audio CXN</a> of de streamers van <a href=\"https://www.marantz.nl/nl/products/pages/productlisting.aspx?catid=hifi&amp;subcatid=networkaudioplayer\" target=\"_blank\" rel=\"noopener noreferrer\">Marantz</a>. Een NAS kun je gebruiken als centrale data opslag in het huishouden en dus ook voor de distributie van muziekbestanden. Onder andere <a href=\"https://www.synology.com/nl-nl\">Synology</a>, <a href=\"https://www.qnap.com/nl-nl/\">QNAP</a> en <a href=\"https://www.wd.com/nl-nl/products/network-attached-storage.html\">Western Digital </a>bieden kwalitatief goede apparaten. Belangrijk is dat de NAS over een DLNA server beschikt. Als de muziek eenmaal op de NAS staat, kan de Mac uit. Dat is ook wel eens fijn. De NAS zelf vindt meestal wel een plekje naast het modem/wifi router in de meterkast.</p>\n<h2 id=\"mcetoc_1d0i4imgh1\" class=\"p1\">Werkwijze</h2>\n<p>Maak je gebruik van een streamer die het DLNA protocol ondersteunt (vrijwel allemaal) dan kun je als volgt te werk gaan:</p>\n<ol class=\"ol1\">\n<li class=\"li1\">Zorg dat je iTunes bibliotheek alleen bestanden bevat in een formaat dat de streamer aan kan. Eigenlijk gaat het altijd goed als je CD’s ript in ALAC of AAC kwaliteit (zie de opmerkingen hieronder). Eventueel MP3 kan ook. Maar maak in geen geval gebruik van FLAC want daar kan iTunes zelf niet mee overweg (zonder hulpprogramma’s).</li>\n<li class=\"li1\">Laat iTunes alle muziek in één bibliotheek plaatsen, zie Voorkeuren -&gt; Geavanceerd en zet een vink bij zowel ‘ Werk map ‘iTunes Media’ bij’ als ‘Kopieer bestanden naar ‘iTunes Media’ bij toevoegen aan bibliotheek’ <img class=\"post__image--center\" src=\"https://www.labhoen.nl/media/posts/7/Schermafbeelding-2019-01-06-om-18.43.59.png\" alt=\"iTunes - Voorkeuren - Geavanceerd\" width=\"682\" height=\"697\"></li>\n<li class=\"li1\">Als je de cover-art uit iTunes wilt overnemen installeer dan het script ‘<a href=\"https://dougscripts.com/itunes/scripts/ss.php?sp=savealbumartjpeg\">Save Album art as JPG’</a> (betaald, $1,99). iTunes bewaart de afbeeldingen in een eigen database. DLNA apparatuur verwacht de cover art in de vorm van een bestand ‘folder.jpg’ in de directory van een geripte CD. Dit script zorgt ervoor dat iedere directory wordt gevuld met het juiste folder.jpg bestand.</li>\n<li class=\"li1\">Maak met de Finder verbinding met de folder van de NAS waar de muziek opgeslagen moet worden. Selecteer in de Finder de NAS en druk op ‘ verbind als’. Meestal heet deze folder ‘music’. Bij twijfel controleer de handleiding van de NAS.</li>\n<li class=\"li1\">Open nu de Terminal toepassing op je Mac en geef het volgende commando op: <code>rsync -av --delete --exclude '.DS_Store' ~/Music/iTunes/iTunes\\ Media/Music/ /Volumes/music</code> Pas indien nodig het laatste stuk '/Volumes/<strong><em>music</em></strong>'  aan aan de specifieke naam zoals gebruikt op de NAS. Dit commando kopieert alle bestanden van de Mac naar de NAS. De eerste keer uitvoeren kan afhankelijk van de omvang van de iTunes bibliotheek en de snelheid van de verbinding even op zich laten wachten. Latere synchronisaties nemen alleen de verschillen met zich mee en gaan aanzienlijk vlotter.</li>\n<li class=\"li1\">Mocht je nu in de toekomst muziek toevoegen of iets wijzigen in afbeelding of beschrijving van een nummer, herhaal dan het commando uit stap 5.</li>\n<li class=\"li1\">Als het goed is, is de NAS nu voorzien van een 100% identieke bibliotheek als die iTunes hanteert. De streamer kan nu onafhankelijk van je Mac gebruikt worden. Vaak heeft de NAS een paar minuten nodig om alle bestanden correct te indexeren, geef hem dus even tijd.</li>\n</ol>\n<h2 id=\"mcetoc_1d0i4hvus0\" class=\"p1\">Nog een paar opmerkingen</h2>\n<p class=\"p1\">Gebruik bijvoorkeur het ALAC (Apple Lossless Audio Codec) bestandsformaat bij het importeren van cd’s. Dit zorgt voor een 100% kopie van de CD maar dan gecomprimeerd (zeg maar ge-zipd). Voorwaarde is dat de streamer met ALAC overweg kan. Dit is in veel gevallen zo, maar niet altijd! Technisch is ALAC vergelijkbaar met FLAC (Free Lossless Audio Codec). Vuistregel: per cd heb je circa 400MB aan vrije ruimte nodig.</p>\n<p class=\"p1\">Sommige NAS apparaten bieden de mogelijkheid tot trans-coderen. Dit zou dé oplossing moeten zijn voor situaties waarbij het bestandsformaat niet door de streamer verwerkt kan worden. De NAS zet het dan (automatisch) om in een voor de streamer begrijpelijk formaat. Zou, want in de praktijk werkt niet iedere combinatie van NAS en streamer op deze wijze vlekkeloos samen.</p>\n<p class=\"p1\">Mocht ALAC niet beschikbaar zijn én trans-coderen biedt geen uitkomst, dan kan je er voor kiezen om alles op te slaan in het AAC (Advanced Audio Codec) formaat. Kies dan wel voor AAC met een bit-rate van 320 kbps, dit levert ‘bijna CD-kwaliteit’. De instellingen vindt je in iTunes onder Voorkeuren -&gt; Algemeen -&gt; Importinstellingen.</p>\n<p class=\"p1\">Mocht je iTunes niet bevallen als CD ripper en daar is best iets voor te zeggen, zie bijvoorbeeld dit artikel van <a href=\"https://www.alpha-audio.nl/achtergrond/vijf-cd-rip-software-pakketten-vergeleken/\"><span class=\"s1\">Alpha-Audio.nl</span></a> maak dan gebruik van <a href=\"https://tmkk.undo.jp/xld/index_e.html\">XLD</a>. Zie ook de website <a href=\"http://www.thewelltemperedcomputer.com/index.html\">The Well Tempered Computer</a> voor de details rond het gebruik van bestandsformaten en XLD.</p>",
            "image": "https://www.labhoen.nl/media/posts/7/macbook-itunes-12-9-update-hero.jpg",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2019-01-06T19:05:56+01:00",
            "date_modified": "2019-01-06T19:05:56+01:00"
        },
        {
            "id": "https://www.labhoen.nl/internetproviders-en-glasvezel-in-het-buitengebied.html",
            "url": "https://www.labhoen.nl/internetproviders-en-glasvezel-in-het-buitengebied.html",
            "title": "Internetproviders en glasvezel in het buitengebied",
            "summary": "De geschiedenis herhaalt zich, zo ook nu weer met de aanleg van glasvezel in het buitengebied van de gemeente Heeze-Leende. Tot eind 2017 woonde ik in Gerwen, nabij Nuenen. Nuenen is al ruim 10 jaar voorzien van glasvezel. Zelfs in een klein dorp als Gerwen zijn&hellip;",
            "content_html": "<p>De geschiedenis herhaalt zich, zo ook nu weer met de aanleg van glasvezel in het buitengebied van de gemeente Heeze-Leende.</p>\n<p>Tot eind 2017 woonde ik in Gerwen, nabij Nuenen. Nuenen is al ruim 10 jaar voorzien van glasvezel. Zelfs in een klein dorp als Gerwen zijn alle huishoudens voorzien van een glasvezelaansluiting zonder dat er sprake was van een eigen bijdrage in de kosten. Dit gold echter niet voor het buitengebied. Hier bleef men aangewezen op beperkte ADSL verbindingen of slechter. Een alternatief als Ziggo is daar niet of nauwelijks voorhanden. Pas sinds deze zomer wordt er door <a href=\"https://www.glasvezelbuitenaf.nl/mabib/\">Mabib</a> werk gemaakt van de aanleg van glasvezel in het buitengebied. Helaas moeten de bewoners een eigen bijdrage van pakweg €1.100 leveren.</p>\n<p>Nu ben ik woonachtig in het buitengebied van Sterksel. Ook hier is sprake van een lokaal initiatief om iedereen gebruik te laten maken van glasvezel verbindingen. Het aansluiten van de dorpen Heeze, Leende en Sterksel is prima gelukt. Maar wederom komt het buitengebied er weer bekaaid af. Na een lange aanloopperiode is de <a href=\"https://www.hslnet.nl\">HSLnet</a> organisatie zover dat het buitengebied ook aangesloten wordt. Helaas wordt er wel een eigen bijdrage van €3.300 gevraagd.</p>\n<p>Gelukkig is er nu iets meer keuze. KPN en andere providers zijn gekomen met 4G producten als alternatief voor de gebrekkige of ontbrekende vaste verbindingen.</p>\n<p>In Nuenen is het beheer van het netwerk via een aantal stappen inmiddels in handen gekomen van KPN. Blijkbaar is er voor de exploitatie van zulke netwerken expertise en schaalgrootte noodzakelijk. Met deze aanpak hoeft een grote provider als KPN geen investeringsrisico te dragen. We zullen zien hoe lang HSLNET zelfstandig zal blijven.</p>",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2018-11-12T21:00:44+01:00",
            "date_modified": "2018-11-12T21:00:44+01:00"
        },
        {
            "id": "https://www.labhoen.nl/sneller-internet-buitengebied-4g.html",
            "url": "https://www.labhoen.nl/sneller-internet-buitengebied-4g.html",
            "title": "Sneller Internet Buitengebied 4G",
            "summary": "in een vorige post zijn de ervaringen met Internet Buitengebied 4G (IB4G) van KPN gedeeld. Eén belangrijk kritiekpunt was het feit dat de Experia box bij gebruik telefonie (en ook TV) aan moet blijven. Consequentie is dat er dan op één locatie feitelijk twee netwerken&hellip;",
            "content_html": "<p class=\"p1\">in een vorige post zijn de ervaringen met Internet Buitengebied 4G (IB4G) van KPN gedeeld. Eén belangrijk kritiekpunt was het feit dat de Experia box bij gebruik telefonie (en ook TV) aan moet blijven. Consequentie is dat er dan op één locatie feitelijk twee netwerken actief zijn.</p>\n<p class=\"p3\">Sinds deze zomer levert KPN een ander product, Sneller Internet Buitengebied 4G (<a href=\"https://www.kpn.com/service/internet/wifi-en-modems/4g-modem-buitengebied.htm\">SIB4G</a>). Technisch is dit gebaseerd op een 4G modem van Sagem. Deze wordt met de Experia Box verbonden. Samen zorgen ze dan voor een grotere bandbreedte. Ookal is het dan geen 3G/4G dongle rechtstreeks in de Experabox, in de praktijk gedraagt deze combinatie zich als één geheel. Zodra de ADSL verbinding aan z’n maximale capaciteit zit wordt de 4G modem ingeschakeld voor extra bandbreedte.</p>\n<p class=\"p2\"><img class=\"post__image--center\" src=\"https://www.labhoen.nl/media/posts/5/c4342e3e-b55e-4f3c-91e7-2fba5c94d264_BAN-buitengebied-ontvanger.jpg\" width=\"275\" height=\"187\"></p>\n<p class=\"p3\">In de praktijk is de snelheidsverhoging opmerkelijk. Van gemiddeld 4Mbps down- en 0,7Mbps upload met enkel ADSL wordt in combinatie met de 4G verbinding een snelheid van circa 36Mbps down- en 10Mbps upload gehaald. Een significante verbetering! Het in- en ook het uitschakelen van de 4G verbinding gaat geheel automatisch.</p>\n<p class=\"p2\">Het dagelijks gebruik van SIB4G levert wel een paar opmerkelijke zaken. Allereerst biedt het 4G modem 3 leds voor de signaalsterkte. In de praktijk brandt er altijd maar 1. De modem is voor de download snelheid weinig richting gevoelig, voor de upload snelheid is dit een ander verhaal. Het verschil tussen matig of goed uitrichten is een verschil tussen 1,5 of 10Mbps.</p>\n<p class=\"p2\">In de praktijk is deze oplossing stabiel gebleken. Zowel streaming diensten (Netflix, Spotify) als het downloaden van grote bestanden vertonen geen rare storingen. Omdat ADSL IPv6 ondersteund werkt in de praktijk ook het uploaden naar websites. Daarnaast is de service van KPN uitstekend gebleken. Zonder toestanden is de modem geleverd en de aansluiting was keurig binnen een week actief.</p>",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2018-11-12T20:56:31+01:00",
            "date_modified": "2018-11-12T21:07:22+01:00"
        },
        {
            "id": "https://www.labhoen.nl/internet-buitengebied-4g.html",
            "url": "https://www.labhoen.nl/internet-buitengebied-4g.html",
            "title": "Internet buitengebied 4G",
            "summary": "Met dank aan KPN wordt hier sinds begin 2018 naast een ADSL lijn ook gebruik gemaakt van Internet Buitengebied, ook wel 4G of boeren internet genoemd. Ik wil jullie deelgenoot maken van mijn ervaringen, wellicht kan iemand hier zijn voordeel mee doen. De situatie hier&hellip;",
            "content_html": "<p class=\"p1\">Met dank aan KPN wordt hier sinds begin 2018 naast een ADSL lijn ook gebruik gemaakt van Internet Buitengebied, ook wel 4G of boeren internet genoemd. Ik wil jullie deelgenoot maken van mijn ervaringen, wellicht kan iemand hier zijn voordeel mee doen.</p>\n<p class=\"p2\">De situatie hier is een ADSL connectie welke maximaal 4Mbps download en 0,7Mbps upload levert. Als aanvulling hierop is Internet Buitengebied 4G (IB4G) op basis van een 4G/LTE modem/router HUAWEI-B525 gerealiseerd.</p>\n<p class=\"p2\"><img class=\"post__image--center\" src=\"https://www.labhoen.nl/media/posts/4/B315-600x600.png\" alt=\"Huwei B525\" width=\"295\" height=\"295\">De snelheid die gehaald wordt varieert van circa 5 tot 65Mbps gemeten met de snelheidstest op de <a href=\"https://kpn-itns.speedtestcustom.com/\">KPN</a> site. De grote variatie in snelheid is opvallend. Deze is blijkbaar sterk afhankelijk van het overige verkeer op het 4G netwerk. Ook lijkt het er op dat de snelheid hoger is net nadat het modem is aangezet. Na verloop van tijd wordt de snelheid duidelijk minder.</p>\n<p class=\"p2\">Opvallend is dat gebruik van Netflix of Uitzending Gemist via de ADSL verbinding leidt tot minder haperingen. Is er een verstoring bij het kijken via 4G dan is voor- of achteruit spoelen erg lastig. Met ADSL gaat dit aanmerkelijk soepeler.</p>\n<p class=\"p2\">De signaalsterkte leds vertellen niet het hele verhaal. Regelmatig is geconstateerd dat een status met 3 of 4 brandende leds niet beter hoeft te zijn dan een status met 1 of 2 leds. Er is blijkbaar nog zoiets als signaalkwaliteit.</p>\n<p class=\"p2\">Het gebruik van externe antennes op het modem geeft een gemengd beeld. Een <a href=\"https://www.capestone.nl/Antennes-en-kabels/Poynting-A-XPOL-0001-omni-antenne-4G-3G-2G-outdoor-antenne-4-dBi-MIMO-2x-5-meter-kabel/\">buitenantenne</a> met een signaalversterking van 4 dBi is in de praktijk nutteloos omdat de 5 meter vaste kabel weer een verzwakking oplevert. Een beter resultaat wordt verkregen met <a href=\"https://www.dectdirect.nl/nl/huawei-b593-b315-b525-antenna.html\">2 losse antennes</a>. De downloadsnelheid loopt op van gemiddeld 40 naar 65Mbps (piekwaarden).</p>\n<p class=\"p2\">Het modem zelf is een wat dubieus apparaat. Het is niet mogelijk zelf de DNS instellingen aan te passen, althans niet voor het WiFi deel, wel voor het ethernet deel. Het WiFi signaal zelf is heel sterk, helaas moeten de netwerken op de 2,4GHz en 5GHz band elk een andere naam hebben. Mijn Apple AirPort Extreme uit 2014 kan al met eenzelfde naam voor beide frequenties werken. De bijbehorende app van Huawei is simpelweg waardeloos.</p>\n<p class=\"p2\">Het ontbreken van bridge mode (volledig uitschakelen van de router functies en direct doorgeven van het externe IP nummer) is zonder meer jammer omdat je dan maar heel beperkt gebruik kunt maken van moderne mesh routers.</p>\n<p class=\"p2\">Het 4G netwerk is volledige IPv4 gebaseerd, de moderne clients (Windows 10, macOs) maken bijvoorkeur gebruik van IPv6. Dit leidt tot problemen bijvoorbeeld wanneer een FTP upload naar een webhoster plaats moet vinden.</p>\n<p class=\"p2\">Zelf gebruik ik naast internet ook telefonie van KPN. Consequentie is dat er nu een 4G modem/router én een Experia box actief zijn. Technisch zou de Huawei ook geschikt moeten zijn voor een telefoonverbinding. De Experia box heeft een usb aansluiting voor een 3G/4G dongle. Er lijkt hier sprake te zijn van overlappende functionaliteit die niet slim gecombineerd kan worden.</p>\n<p class=\"p2\">Kortom: Internet Buitengebied is een prima antwoord op het gebrek aan bandbreedte maar is niet een volledige vervanger van een ADSL verbinding. Daarvoor zijn de nukken en kuren (nog) te groot.</p>",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2018-11-12T20:51:02+01:00",
            "date_modified": "2018-11-12T21:12:43+01:00"
        },
        {
            "id": "https://www.labhoen.nl/hosten-van-een-blog.html",
            "url": "https://www.labhoen.nl/hosten-van-een-blog.html",
            "title": "Hosten van een blog",
            "summary": "Het is niet eenvoudig een blog te maken. De keuze voor hosting en software hangt heel nauw met elkaar samen. Wordpress, Joomla en soortgenoten kun je zelf hosten maar ook laten hosten. Daarnaast is er ook nog zo iets als privacy van de blogger en&hellip;",
            "content_html": "<p class=\"p1\">Het is niet eenvoudig een blog te maken. De keuze voor hosting en software hangt heel nauw met elkaar samen. <a href=\"http://www.wordpress.com\">Wordpress</a>, <a href=\"https://www.joomla.com\">Joomla</a> en soortgenoten kun je zelf hosten maar ook laten hosten. Daarnaast is er ook nog zo iets als privacy van de blogger en bezoekers.</p>\n<p><img class=\"post__image--full align-center\" src=\"https://www.labhoen.nl/media/posts/3/Schermafbeelding-2018-11-10-om-17.20.13.png\" alt=\"\" width=\"300\" height=\"263\"></p>\n<p>Het zelf hosten van blogsoftware heeft de nodige haken en ogen. Je zult de software actueel moeten houden wil je voorkomen dat je site misbruikt wordt door internet gespuis. Maar wie heeft zin allerlei technische complexe zaken als updates en incompatible plug-ins? Met andere worden, alleen als de hoster de verantwoordelijkheid op zich neemt voor het actueel houden van de software is dit een (betaalde) optie.</p>\n<p>Kies je voor een hosting platform dan loop je wel het risico dat jou site wordt gebruikt om nog meer te weten te komen over de bezoekers. <a href=\"https://www.blogger.com\">Blogger</a> (van Google) staat stijf van de analytische scripts, maar dit geldt evengoed voor <span class=\"s1\">WordPress</span> of <span class=\"s1\">Jimdo.</span></p>\n<p>Voor dit blog is er een andere weg gevolgd. <a href=\"https://getpublii.com\">Publii</a> wordt gebruikt als offline editor om de site te beheren en de posts aan te maken. Het resultaat wordt geupload naar <a href=\"https://pages.github.com\">GitHub</a> Pages. Het offline aanmaken van een site haalt een zeker risico weg, immers er is geen login pagina op het web meer toegankelijk. Bijkomend voordeel is, is dat de site snel is. Er komt geen PHP of database meer aan te pas. Het nadeel van een offline editor is dat je er niet vanaf iedere plek bij kunt.</p>",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2018-11-10T17:23:02+01:00",
            "date_modified": "2018-11-10T17:27:19+01:00"
        },
        {
            "id": "https://www.labhoen.nl/tweede-post.html",
            "url": "https://www.labhoen.nl/tweede-post.html",
            "title": "Tweede Post",
            "summary": "Glow, Eindhoven, 10-17 November. Pakweg 30 kunstenaars met de mooiste creaties voor de november nacht. De meeste installaties zijn gratis toegankelijk.",
            "content_html": "<a href=\"https://gloweindhoven.nl\">Glow</a>, Eindhoven, 10-17 November. Pakweg 30 kunstenaars met de mooiste creaties voor de november nacht. De meeste installaties zijn gratis toegankelijk.",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2018-11-10T15:15:42+01:00",
            "date_modified": "2018-11-10T16:11:20+01:00"
        },
        {
            "id": "https://www.labhoen.nl/test.html",
            "url": "https://www.labhoen.nl/test.html",
            "title": "Eerste post",
            "summary": "De eerste post op een eerste site gehost door GitHub pages. We gaan in de praktijk ontdekken hoe of het werkt. Als het bevalt is dit wellicht de basis voor een andere site maar daar over later.",
            "content_html": "De eerste post op een eerste site gehost door GitHub pages. We gaan in de praktijk ontdekken hoe of het werkt. Als het bevalt is dit wellicht de basis voor een andere site maar daar over later.",
            "author": {
                "name": "mrhoen"
            },
            "tags": [
            ],
            "date_published": "2018-05-01T20:13:31+02:00",
            "date_modified": "2018-11-10T16:28:25+01:00"
        }
    ]
}
